Дошкольное_учреждение83/src/InformationRegisters/удуШтатноеРасписаниеОрганизаций/удуШтатноеРасписаниеОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуШтатноеРасписаниеОрганизаций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальнаяТарифнаяСтавкаУдалить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяТарифнаяСтавкаУдалить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидТарифнойСтавкиУдалить</name>
    <type>
      <types>EnumRef.удуВидыТарифныхСтавок</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботыУдалить</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>МесячнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НадбавкаПоРайонномуКоэффициенту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.удуОсновныеНачисленияОрганизаций</types>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.удуПодразделенияУчереждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуРаботникиОрганизаций/удуРаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуРаботникиОрганизаций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.удуПодразделенияУчереждения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.удуПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.удуПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.удуУвольнениеИзОрганизаций</types>
      <types>DocumentRef.удуКадровоеПеремещениеОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуСотрудникиОсвободившиеСтавкиВОрганизациях/удуСотрудникиОсвободившиеСтавкиВОрганизациях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСотрудникиОсвободившиеСтавкиВОрганизациях</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсвобождатьСтавку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсвобождатьСтавкуЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуСпособыРасчетаОплатыТруда/удуСпособыРасчетаОплатыТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСпособыРасчетаОплатыТруда</name>
  <enumValues>
    <name>НулеваяСумма</name>
    <comment>ВР без расчета результата</comment>
  </enumValues>
  <enumValues>
    <name>ПоДоговоруФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ПоДневнойТарифнойСтавке</name>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоДням</name>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоЧасам</name>
  </enumValues>
  <enumValues>
    <name>ПоЧасовойТарифнойСтавке</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДо1_5Лет</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДо3Лет</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуФСС</name>
  </enumValues>
  <enumValues>
    <name>ФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаВечерниеЧасы</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаНочныеЧасы</name>
  </enumValues>
  <enumValues>
    <name>ПочтовыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистПроцентом</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистПроцентомДоПредела</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистФиксСуммойДоПредела</name>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПоДневнойТарифнойСтавке</name>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПоМесячнойТарифнойСтавкеПоДням</name>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПоМесячнойТарифнойСтавкеПоЧасам</name>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПоЧасовойТарифнойСтавке</name>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПроцентом</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработка</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуДляОтпускаПоШестидневке</name>
  </enumValues>
  <enumValues>
    <name>Процентом</name>
  </enumValues>
  <enumValues>
    <name>ПроцентомОтОблагаемыхЕСННачислений</name>
  </enumValues>
  <enumValues>
    <name>СдельныйЗаработок</name>
  </enumValues>
  <enumValues>
    <name>СевернаяНадбавка</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>СохраняемоеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>МесячноеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>СохраняемоеДенежноеСодержаниеОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяФормула</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработкаФСС</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/удуВидыВремени/удуВидыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыВремени</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
    <comment>Неотработанные полные смены</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
    <comment>Неотработанные неполные смены</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/удуПричиныИзмененияСостояния/удуПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуПричиныИзмененияСостояния</name>
  <enumValues>
    <name>ПриемНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/CommonModules/удуПроцедурыУправленияПерсоналом/Module.bsl
// Процедура строит список должностей (или подразделений), по штатному расписанию организации.
//  
// Параметры: 
//  Режим - строка, может принимать значения: "Должность" или "ПодразделениеОрганизации"
//			определяет, что именно будет выбирать пользователь
//  ДолжностьИлиПодразделениеОрганизации - СправочникСсылка.удуПодразделенияУчереждения или   
//          СправочникСсылка.Должности, второе значение в текущей строке т.п.
//
// Возвращаемое значение
//  нет
//
Функция ВыбратьИзШтатногоРасписанияОрганизации(Режим, Организация, ДолжностьИлиПодразделениеОрганизации, ДатаАктуальности = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(ДолжностьИлиПодразделениеОрганизации) Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Организация);
	Запрос.УстановитьПараметр("ДолжностьИлиПодразделениеОрганизации", ДолжностьИлиПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	Если Режим = "ПодразделениеОрганизации" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации КАК Элемент,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ЭлементНаименование
		|ИЗ
		|	РегистрСведений.удуШтатноеРасписаниеОрганизаций.СрезПоследних(&ДатаАктуальности, ПодразделениеОрганизации.Организация = &Владелец) КАК ШтатноеРасписаниеОрганизацийСрезПоследних
		|ГДЕ
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность = &ДолжностьИлиПодразделениеОрганизации
		|	И ШтатноеРасписаниеОрганизацийСрезПоследних.КоличествоСтавок > 0";
		
	ИначеЕсли Режим = "Должность" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность КАК Элемент,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность.Наименование КАК ЭлементНаименование
		|ИЗ
		|	РегистрСведений.удуШтатноеРасписаниеОрганизаций.СрезПоследних(&ДатаАктуальности, ПодразделениеОрганизации.Организация = &Владелец) КАК ШтатноеРасписаниеОрганизацийСрезПоследних
		|ГДЕ
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации = &ДолжностьИлиПодразделениеОрганизации
		|	И ШтатноеРасписаниеОрганизацийСрезПоследних.КоличествоСтавок > 0";
		
	Иначе
		Возврат Новый СписокЗначений
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый СписокЗначений
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
	СписокВыбора = Новый СписокЗначений();
	
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Элемент, Выборка.ЭлементНаименование);	
	КонецЦикла;
	
    Возврат СписокВыбора
	
КонецФункции // ВыбратьИзШтатногоРасписанияОрганизации

// Функция возвращаект сведения о позиции штатного расписания на выбранную дату
// для измерений Подразделение и Должность
//
Функция СведенияОПозицииШтатногоРасписания(Период, Подразделение, Должность) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаАктуальности",	Период);
	Запрос.УстановитьПараметр("Подразделение",		Подразделение);
	Запрос.УстановитьПараметр("Должность",			Должность);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.КоличествоСтавок,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяСтавка,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.СевернаяНадбавка,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.НадбавкаПоРайонномуКоэффициенту,
	|	ШтатноеРасписаниеОрганизацийСрезПоследних.ВидРасчета
	|ИЗ
	|	РегистрСведений.удуШтатноеРасписаниеОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		ПодразделениеОрганизации = &Подразделение
	|			И Должность = &Должность) КАК ШтатноеРасписаниеОрганизацийСрезПоследних";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // СведенияОПозицииШтатногоРасписания()

// Функция проверяет необходимость задавать размер для расчета по заданному способу.
// Парамерты:
//	СпособРасчета
//
// Возвращаемое значение:
//	булево - признак того, нужен ли размер для расчета таким способом
//
Функция СпособРасчетаТребуетРазмер(СпособРасчета) Экспорт
	Возврат НЕ (
    СпособРасчета = Перечисления.удуСпособыРасчетаОплатыТруда.СдельныйЗаработок 
	    или СпособРасчета = Перечисления.удуСпособыРасчетаОплатыТруда.НулеваяСумма 
		или СпособРасчета = Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПроцентом 
		или СпособРасчета = Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПоЧасовойТарифнойСтавке 
	    или СпособРасчета = Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПоМесячнойТарифнойСтавкеПоЧасам 
	    или СпособРасчета = Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПоМесячнойТарифнойСтавкеПоДням 
	    или СпособРасчета = Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПоДневнойТарифнойСтавке 
	    или СпособРасчета = Перечисления.удуСпособыРасчетаОплатыТруда.СевернаяНадбавка
		или СпособРасчета = Перечисления.удуСпособыРасчетаОплатыТруда.ПроизвольнаяФормула
  );
КонецФункции


// Эта функция возвращает информацию о виде расчета 
//
// Параметры:      
//
//	ВидРасчета - ПланВидовРасчетаСсылка
//
// Возвращаемое значение:
//  Структура
//
Функция ПреобразоватьСведенияОВидеРасчетаСхемыМотивацииВТаблицуЗначений(СведенияОВидеРасчета,СведенияОРазмере) Экспорт
			
		ТЗСведенияОВидеРасчета=Новый ТаблицаЗначений;
		ТЗСведенияОВидеРасчета.Колонки.Добавить("Показатель");
		ТЗСведенияОВидеРасчета.Колонки.Добавить("Размер");
		
		Для СчПоказателей = 1 По 6 Цикл
			Если СчПоказателей <= СведенияОВидеРасчета["КоличествоПоказателей"] Тогда
				Если СведенияОВидеРасчета["Показатель" + СчПоказателей + "НаименованиеВидимость"] Тогда
					СтрокаТЗ=ТЗСведенияОВидеРасчета.Добавить();
					СтрокаТЗ.Показатель=СведенияОВидеРасчета["Показатель" + СчПоказателей+ "Наименование"];
					СтрокаТЗ.Размер=СведенияОРазмере["Размер" + СчПоказателей];
				КонецЕсли;		
			КонецЕсли;
		КонецЦикла;
				
	Возврат ТЗСведенияОВидеРасчета;
	
КонецФункции  // ПреобразоватьСведенияОВидеРасчетаСхемыМотивацииВТаблицуЗначений

// Функция возвращает структуру с отборами для выбора из ПланыВидовРасчета.удуОсновныеНачисленияОрганизаций.
// в.р., являющегося надбавкой
// структура параметров отбора может использоваться в процедурах АвтоПодборТекстаВЭлементеУправления
//
// Параметры
//
// Возвращаемое значение:
//   Структура   - структура, ключ - имя реквизита ПВР, значение - массив со значениями отбора
//
Функция ПолучитьОтборыНадбавокСотрудникаИлиДанныеДляОтбора(НастройкиОтбора=истина,Текст="") Экспорт
	
	СпособыРасчета = Новый Массив;
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням);
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам);
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке);
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПоМесячнойТарифнойСтавкеПоДням);
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПоМесячнойТарифнойСтавкеПоЧасам);
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПоДневнойТарифнойСтавке);
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПоЧасовойТарифнойСтавке);
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ОтСтажаПроцентом);
    СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.Процентом);
	СпособыРасчета.Добавить(Перечисления.удуСпособыРасчетаОплатыТруда.ПроизвольнаяФормула);

	Если НастройкиОтбора Тогда 
	
	НастройкиКомпоновкиДанных=Новый НастройкиКомпоновкиДанных;
	удуУправлениеОтчетами.УстановитьОтбор(НастройкиКомпоновкиДанных, "ВидВремени", Перечисления.удуВидыВремени.ДополнительноОплачиваемоеВПределахНормы,
		ВидСравненияКомпоновкиДанных.Равно,,, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
    удуУправлениеОтчетами.УстановитьОтбор(НастройкиКомпоновкиДанных, "Предопределенный", ложь,
		ВидСравненияКомпоновкиДанных.Равно,,, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	удуУправлениеОтчетами.УстановитьОтбор(НастройкиКомпоновкиДанных, "СпособРасчета", СпособыРасчета,
		ВидСравненияКомпоновкиДанных.ВСписке,,, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	Возврат НастройкиКомпоновкиДанных;
	
	Иначе 	
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	удуОсновныеНачисленияОрганизаций.Ссылка
		             |ИЗ
		             |	ПланВидовРасчета.удуОсновныеНачисленияОрганизаций КАК удуОсновныеНачисленияОрганизаций
		             |ГДЕ
		             |	удуОсновныеНачисленияОрганизаций.ВидВремени = ЗНАЧЕНИЕ(Перечисление.удуВидыВремени.ДополнительноОплачиваемоеВПределахНормы)
		             |	И удуОсновныеНачисленияОрганизаций.СпособРасчета В(&СпособыРасчета)
		             |	И удуОсновныеНачисленияОрганизаций.Предопределенный = ЛОЖЬ
		             |	И ВЫБОР
		             |			КОГДА &Текст = """"
		             |				ТОГДА ИСТИНА
		             |			ИНАЧЕ удуОсновныеНачисленияОрганизаций.Наименование ПОДОБНО &Текст
		             |		КОНЕЦ";
		Запрос.УстановитьПараметр("СпособыРасчета",СпособыРасчета);
		Запрос.УстановитьПараметр("Текст",Текст);
		СписокРасчетов=Новый СписокЗначений;
		СписокРасчетов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
		Возврат СписокРасчетов;
		
	КонецЕсли;
	
КонецФункции // ПолучитьСтруктуруОтборовНадбавокСотрудника()

// Функция возвращает структуру с отборами для выбора из ПланыВидовРасчета.удуОсновныеНачисленияОрганизаций.
// основного начисления сотрудника, регистрирующего отработанное время
// структура параметров отбора может использоваться в процедурах АвтоПодборТекстаВЭлементеУправления
//
// Параметры
//
// Возвращаемое значение:
//   Структура   - структура, ключ - имя реквизита ПВР, значение - массив со значениями отбора
//
Функция ПолучитьОтборыОсновногоНачисленияСотрудника(НастройкиОтбора=истина,Текст="") Экспорт
	
	Если НастройкиОтбора Тогда 
	
	НастройкиКомпоновкиДанных=Новый НастройкиКомпоновкиДанных;
	удуУправлениеОтчетами.УстановитьОтбор(НастройкиКомпоновкиДанных, "ВидВремени", Перечисления.удуВидыВремени.ОтработанноеВПределахНормы,
		ВидСравненияКомпоновкиДанных.Равно,,, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	Возврат НастройкиКомпоновкиДанных;	
	Иначе 
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	удуОсновныеНачисленияОрганизаций.Ссылка
		             |ИЗ
		             |	ПланВидовРасчета.удуОсновныеНачисленияОрганизаций КАК удуОсновныеНачисленияОрганизаций
		             |ГДЕ
		             |	удуОсновныеНачисленияОрганизаций.ВидВремени = ЗНАЧЕНИЕ(Перечисление.удуВидыВремени.ОтработанноеВПределахНормы)";
		СписокРасчетов=Новый СписокЗначений;
		СписокРасчетов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
		Возврат СписокРасчетов;

	КонецЕсли;
	
КонецФункции // ПолучитьСтруктуруОтборовОсновногоНачисленияСотрудника()

// процедура устанавливает текущую строку в табличных полях формы 
// объекта, связанных с табличными частями объекта
// предположения:
// все табличные части и соответсвующие им табличные поля - одноименны
// все "синхронизируемые" табличные части имеют колонку с одинаковым 
// именем по которой ведется синхронизация
// 
// Параметры:
//  Объект - объект данных
//  Элемент - элемент формы в котором возникла активизация строки
//  СинхронизируемыеТабличныеЧасти - соответствие с 
//  			элементами, соответствующими синхронизируемым табличным полям
//  ИмяКолонки - имя колнки синхронизации
Функция СинхронизироватьСтроки(Объект, Элемент, СинхронизируемыеТабличныеЧасти, ИмяКолонки,ЭлементПоиска) Экспорт
	
	ТекущиеСтрокиСинхронизации=Новый Структура;
	
	Если ЭлементПоиска = Неопределено Тогда
		Возврат ТекущиеСтрокиСинхронизации;
	КонецЕсли;
	
	Имя = Элемент.Имя;
	Если СинхронизируемыеТабличныеЧасти[Имя] Тогда
		Возврат ТекущиеСтрокиСинхронизации;
	КонецЕсли;
		
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить(ИмяКолонки, ЭлементПоиска);
	
	
	
	Для Каждого ЭлементСоответствия Из СинхронизируемыеТабличныеЧасти Цикл
		Если ЭлементСоответствия.Ключ = Имя Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторСтроки = Неопределено;
		Попытка
			Строки = Объект[ЭлементСоответствия.Ключ].НайтиСтроки(СтруктураПоиска);
			Если Строки.Количество() > 0 Тогда
				ИдентификаторСтроки=Строки[0].ПолучитьИдентификатор();
			КонецЕсли;
		Исключение
		КонецПопытки;
		Если ИдентификаторСтроки <> Неопределено Тогда
			ТекущиеСтрокиСинхронизации.Вставить(ЭлементСоответствия.Ключ,ИдентификаторСтроки);
		КонецЕсли;
		
	КонецЦикла;

	Возврат ТекущиеСтрокиСинхронизации;
	
КонецФункции  //  СинхронизироватьСтроки



// Вычисляет количество временно освобожденных ставок для переданных строк штатного.
// 	расписания на указанные в строках даты
//
// Параметры
//  ТаблицаСтрок - Таблица значений с колонками НомерСтроки, ДатаНачала, ПодразделениеОрганизации, Должность
//  ГоловнаяОрганизация - СправочникСсылка.Организации - головная организация документа
//
// Возвращаемое значение:
//   Таблица значений с колонками НомерСтроки, ОсвобожденныеСтавки 
//
Функция ВременноСвободныеСтавкиСтрокШтатногоРасписания(ТаблицаСтрок, ГоловнаяОрганизация) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ДанныеДокумента", ТаблицаСтрок);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиДокумента.НомерСтроки КАК НомерСтроки,
	|	РаботникиДокумента.ДатаНачала,
	|	РаботникиДокумента.ПодразделениеОрганизации,
	|	РаботникиДокумента.Должность
	|ПОМЕСТИТЬ ВТСтрокиДокумента
	|ИЗ
	|	&ДанныеДокумента КАК РаботникиДокумента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	|	ТЧРаботникиОрганизации.ДатаНачала,
	|	ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ДатыПоследнихДвиженийРаботников.Сотрудник
	|ПОМЕСТИТЬ ВТСотрудникиНаШтатныхЕдиницах
	|ИЗ
	|	ВТСтрокиДокумента КАК ТЧРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	|			МАКСИМУМ(Работники.Период) КАК Период,
	|			Работники.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТСтрокиДокумента КАК ТЧРаботникиОрганизации
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.удуРаботникиОрганизаций КАК Работники
	|				ПО ТЧРаботникиОрганизации.ДатаНачала >= Работники.Период
	|		ГДЕ
	|			Работники.Организация = &ГоловнаяОрганизация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧРаботникиОрганизации.НомерСтроки,
	|			Работники.Сотрудник) КАК ДатыПоследнихДвиженийРаботников
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.удуРаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
	|			ПО ДатыПоследнихДвиженийРаботников.Период = ДанныеПоРаботникуДоНазначения.Период
	|				И ДатыПоследнихДвиженийРаботников.Сотрудник = ДанныеПоРаботникуДоНазначения.Сотрудник
	|		ПО ТЧРаботникиОрганизации.НомерСтроки = ДатыПоследнихДвиженийРаботников.НомерСтроки
	|ГДЕ
	|	ТЧРаботникиОрганизации.ПодразделениеОрганизации = ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации
	|	И ТЧРаботникиОрганизации.Должность = ДанныеПоРаботникуДоНазначения.Должность
	|	И ДанныеПоРаботникуДоНазначения.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.удуПричиныИзмененияСостояния.Увольнение)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПоследнихИзмененийСотрудников.НомерСтроки,
	|	ДатыПоследнихИзмененийСотрудников.Сотрудник,
	|	ДатыПоследнихИзмененийСотрудников.ДатаНачала
	|ПОМЕСТИТЬ ВТСотрудникиОсвободившиеСтавку
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(СотрудникиОсвободившиеСтавкиВОрганизациях.Период) КАК ПериодПоследнегоДвижения,
	|		СотрудникиОсвободившиеСтавкиВОрганизациях.Сотрудник КАК Сотрудник,
	|		СтрокиДокумента.НомерСтроки КАК НомерСтроки,
	|		СтрокиДокумента.ДатаНачала КАК ДатаНачала
	|	ИЗ
	|		ВТСотрудникиНаШтатныхЕдиницах КАК СтрокиДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.удуСотрудникиОсвободившиеСтавкиВОрганизациях КАК СотрудникиОсвободившиеСтавкиВОрганизациях
	|			ПО СтрокиДокумента.ДатаНачала >= СотрудникиОсвободившиеСтавкиВОрганизациях.Период
	|				И СтрокиДокумента.Сотрудник.Организация = СотрудникиОсвободившиеСтавкиВОрганизациях.Организация
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтрокиДокумента.НомерСтроки,
	|		СотрудникиОсвободившиеСтавкиВОрганизациях.Сотрудник,
	|		СтрокиДокумента.ДатаНачала) КАК ДатыПоследнихИзмененийСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.удуСотрудникиОсвободившиеСтавкиВОрганизациях КАК СотрудникиОсвободившиеСтавкиВОрганизацияхСрезПоследних
	|		ПО ДатыПоследнихИзмененийСотрудников.ПериодПоследнегоДвижения = СотрудникиОсвободившиеСтавкиВОрганизацияхСрезПоследних.Период
	|			И ДатыПоследнихИзмененийСотрудников.Сотрудник = СотрудникиОсвободившиеСтавкиВОрганизацияхСрезПоследних.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СотрудникиОсвободившиеСтавкиВОрганизацияхСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|					И СотрудникиОсвободившиеСтавкиВОрганизацияхСрезПоследних.ПериодЗавершения <= ДатыПоследнихИзмененийСотрудников.ДатаНачала
	|				ТОГДА СотрудникиОсвободившиеСтавкиВОрганизацияхСрезПоследних.ОсвобождатьСтавкуЗавершения
	|			ИНАЧЕ СотрудникиОсвободившиеСтавкиВОрганизацияхСрезПоследних.ОсвобождатьСтавку
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеДаты.НомерСтроки,
	|	РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизаций.Должность КАК Должность,
	|	СУММА(РаботникиОрганизаций.ЗанимаемыхСтавок) КАК Ставка
	|ПОМЕСТИТЬ ОсвободившиесяСтавки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТСотрудникиОсвободившиеСтавку.НомерСтроки КАК НомерСтроки,
	|		ВТСотрудникиОсвободившиеСтавку.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период
	|	ИЗ
	|		ВТСотрудникиОсвободившиеСтавку КАК ВТСотрудникиОсвободившиеСтавку
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.удуРаботникиОрганизаций КАК РаботникиОрганизаций
	|			ПО ВТСотрудникиОсвободившиеСтавку.ДатаНачала >= РаботникиОрганизаций.Период
	|				И ВТСотрудникиОсвободившиеСтавку.Сотрудник = РаботникиОрганизаций.Сотрудник
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТСотрудникиОсвободившиеСтавку.НомерСтроки,
	|		ВТСотрудникиОсвободившиеСтавку.Сотрудник) КАК ПоследниеДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.удуРаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО ПоследниеДаты.Сотрудник = РаботникиОрганизаций.Сотрудник
	|			И ПоследниеДаты.Период = РаботникиОрганизаций.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеДаты.НомерСтроки,
	|	РаботникиОрганизаций.ПодразделениеОрганизации,
	|	РаботникиОрганизаций.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтрокиДокумента.НомерСтроки,
	|	СУММА(ОсвободившиесяСтавки.Ставка) КАК ОсвобожденныеСтавки
	|ИЗ
	|	ВТСтрокиДокумента КАК ВТСтрокиДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОсвободившиесяСтавки КАК ОсвободившиесяСтавки
	|		ПО ВТСтрокиДокумента.НомерСтроки = ОсвободившиесяСтавки.НомерСтроки
	|			И ВТСтрокиДокумента.ПодразделениеОрганизации = ОсвободившиесяСтавки.ПодразделениеОрганизации
	|			И ВТСтрокиДокумента.Должность = ОсвободившиесяСтавки.Должность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтрокиДокумента.НомерСтроки";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ВременноСвободныеСтавкиСтрокШтатногоРасписания()
